SIGS618/GD32IDE-Project---Learn/firmware/GD32E23x_hal_peripheral/Source/gd32e23x_hal_fmc.c
/*!
    \file    gd32e23x_hal_fmc.c
    \brief   FMC driver

    \version 2019-03-14, V1.0.0, firmware for GD32E23x
*/

/*
    Copyright (c) 2019, GigaDevice Semiconductor Inc.

    All rights reserved.

    Redistribution and use in source and binary forms, with or without modification, 
are permitted provided that the following conditions are met:

    1. Redistributions of source code must retain the above copyright notice, this 
       list of conditions and the following disclaimer.
    2. Redistributions in binary form must reproduce the above copyright notice, 
       this list of conditions and the following disclaimer in the documentation 
       and/or other materials provided with the distribution.
    3. Neither the name of the copyright holder nor the names of its contributors 
       may be used to endorse or promote products derived from this software without 
       specific prior written permission.

    THIS SOFTWARE IS PROVIDED BY THE COPYRIGHT HOLDERS AND CONTRIBUTORS "AS IS" 
AND ANY EXPRESS OR IMPLIED WARRANTIES, INCLUDING, BUT NOT LIMITED TO, THE IMPLIED 
WARRANTIES OF MERCHANTABILITY AND FITNESS FOR A PARTICULAR PURPOSE ARE DISCLAIMED. 
IN NO EVENT SHALL THE COPYRIGHT HOLDER OR CONTRIBUTORS BE LIABLE FOR ANY DIRECT, 
INDIRECT, INCIDENTAL, SPECIAL, EXEMPLARY, OR CONSEQUENTIAL DAMAGES (INCLUDING, BUT 
NOT LIMITED TO, PROCUREMENT OF SUBSTITUTE GOODS OR SERVICES; LOSS OF USE, DATA, OR 
PROFITS; OR BUSINESS INTERRUPTION) HOWEVER CAUSED AND ON ANY THEORY OF LIABILITY, 
WHETHER IN CONTRACT, STRICT LIABILITY, OR TORT (INCLUDING NEGLIGENCE OR OTHERWISE) 
ARISING IN ANY WAY OUT OF THE USE OF THIS SOFTWARE, EVEN IF ADVISED OF THE POSSIBILITY 
OF SUCH DAMAGE.
*/

#include "gd32e23x_hal.h"

/* define array if it is necessary to reserve original data located in out of targeted scope */
#if (1U == FLASH_OPER_RESERVE_ORIGINAL_DATA)
static uint8_t _g_fmc_cache[FMC_PAGE_SIZE];
#endif

/* reserve original data located in out of targeted scope */
static void _fmc_page_erase_update(uint8_t *p_buffer, uint32_t size, uint32_t page_addr, \
                             uint32_t page_offset);
static void _fmc_program_align_word(uint32_t dst_addr, uint8_t *data, uint32_t size);

/*!
    \brief      unlock the main FMC operation
                it is better to used in pairs with fmc_lock
    \param[in]  none
    \param[out] none
    \retval     none
*/
void hal_fmc_unlock(void)
{
    fmc_unlock();
}

/*!
    \brief      lock the main FMC operation
                it is better to used in pairs with fmc_unlock after an operation
    \param[in]  none
    \param[out] none
    \retval     none
*/
void hal_fmc_lock(void)
{
    fmc_lock();
}

/*!
    \brief      enable flash prefetch
    \param[in]  none
    \param[out] none
    \retval     none
*/
void hal_fmc_prefetch_enable(void)
{
    fmc_prefetch_enable();
}

/*!
    \brief      disable flash prefetch
    \param[in]  none
    \param[out] none
    \retval     none
*/
void hal_fmc_prefetch_disable(void)
{
    fmc_prefetch_disable();
}

/*!
    \brief      set the wait state counter value
    \param[in]  wscnt: wait state counter value
      \arg        WS_WSCNT_0: 0 wait state added
      \arg        WS_WSCNT_1: 1 wait state added
      \arg        WS_WSCNT_2: 2 wait state added
    \param[out] none
    \retval     none
*/
void hal_fmc_wscnt_set(uint8_t wscnt)
{
    fmc_wscnt_set(wscnt);
}
/*!
    \brief      read flash target region
    \param[in]  start_addr: target region start address 
    \param[in]  data: pointer to read result
    \param[in]  size: target region size
    \param[out] none
    \retval     none
*/
void hal_fmc_region_read(uint32_t start_addr, uint8_t *data, uint32_t size)
{
    uint32_t counter;
    
#if (1 == HAL_PARAMETER_CHECK)
    /* check the parameters */
    if((start_addr < FMC_BASE_ADDRESS)||(start_addr > FMC_END_ADDRESS)){
        HAL_DEBUGE("parameter [start_addr] is a invalid address.");
    }
    if(size > (FMC_END_ADDRESS - start_addr)){
        HAL_DEBUGE("target data size exceed flash atual address scope.");
    }
#endif /* 1 == HAL_PARAMETER_CHECK */
    
    /* assign flash specific data to pointer */
    for(counter = 0U; counter < size; counter++){
        *(data + counter) = REG8(start_addr + counter);
    }
}

/*!
    \brief      write flash target address in word
    \param[in]  addr: target address 
    \param[in]  data: target data
    \param[out] none
    \retval     fmc_state_enum: state of FMC
      \arg        FMC_READY: the operation has been completed
      \arg        FMC_BUSY: the operation is in progress
      \arg        FMC_PGERR: program error
      \arg        FMC_PGAERR: program alignment error
      \arg        FMC_WPERR: erase/program protection error
      \arg        FMC_TOERR: timeout error
      \arg        FMC_OB_HSPC: option byte security protection code high
*/
fmc_state_enum hal_fmc_word_program(uint32_t addr, uint32_t data)
{
#if (1 == HAL_PARAMETER_CHECK)
    /* check the parameter */
    if((addr < FMC_BASE_ADDRESS)||(addr > FMC_END_ADDRESS)){
        HAL_DEBUGE("parameter [addr] is a invalid address.");
    }
#endif /* 1 == HAL_PARAMETER_CHECK */
    
    return(fmc_word_program(addr, data));
}

/*!
    \brief      write flash target address in double words
    \param[in]  addr: target address 
    \param[in]  data: target data
    \param[out] none
    \retval     fmc_state_enum: state of FMC
      \arg        FMC_READY: the operation has been completed
      \arg        FMC_BUSY: the operation is in progress
      \arg        FMC_PGERR: program error
      \arg        FMC_PGAERR: program alignment error
      \arg        FMC_WPERR: erase/program protection error
      \arg        FMC_TOERR: timeout error
      \arg        FMC_OB_HSPC: option byte security protection code high
*/
fmc_state_enum hal_fmc_doubleword_program(uint32_t addr, uint64_t data)
{
#if (1 == HAL_PARAMETER_CHECK)
    /* check the parameter */
    if((addr < FMC_BASE_ADDRESS)||(addr > FMC_END_ADDRESS)){
        HAL_DEBUGE("parameter [addr] is a invalid address.");
    }
#endif /* 1 == HAL_PARAMETER_CHECK */
    
    return(fmc_doubleword_program(addr, data));
}

/*!
    \brief      write flash target region with amounts of data
    \param[in]  start_addr: target region start address 
    \param[in]  size: target region size
    \param[out] none
    \retval     error code: HAL_ERR_NONE, HAL_ERR_ADDRESS, HAL_ERR_VAL details refer to gd32e23x_hal.h
*/
int32_t hal_fmc_region_write(uint32_t start_addr, uint8_t *data, uint32_t size)
{
    uint32_t counter = 0U;
    uint32_t remaining = size;
    uint32_t update_offset = 0U;
    uint8_t *src_addr = data;
    uint32_t page_offset = 0U;
    uint32_t write_addr_limit = ((start_addr + size) / FMC_PAGE_SIZE + 1U) * FMC_PAGE_SIZE;
    uint16_t write_buffer_size;
    uint32_t page_addr;
    uint8_t  non_ff_flag = 0U;
    uint32_t length, left_align,right_align;
    uint8_t right_align_complement = 0U;
    uint32_t addr_size_temp = (start_addr / FMC_PAGE_SIZE)* FMC_PAGE_SIZE ;
    uint8_t single_page_flag; 
    /* check whether all data is at the same page */
    if((write_addr_limit - addr_size_temp) > FMC_PAGE_SIZE){
        single_page_flag = 0U;
    }else{
        single_page_flag = 1U;
    }
    page_offset = start_addr - (start_addr / FMC_PAGE_SIZE) * FMC_PAGE_SIZE;

    /* calculate left and right align edge */
    left_align = page_offset - page_offset % 4U;
    if((page_offset + size) % 4U){
        right_align_complement = 4U - (page_offset + size) % 4U;
    }else{
        right_align_complement = 0U;
    }
    right_align = (page_offset + size + right_align_complement) % FMC_PAGE_SIZE;
    if(0U == right_align)
    right_align = FMC_PAGE_SIZE;
    
