SIGS618/GD32IDE-Project---Learn/firmware/GD32E23x_hal_peripheral/Source/gd32e23x_hal_fmc.c
#if (1 == HAL_PARAMETER_CHECK)
    /* check the parameters */
    if((start_addr < FMC_BASE_ADDRESS)||(start_addr > FMC_END_ADDRESS)){
        HAL_DEBUGE("parameter [start_addr] is a invalid address.");
        return HAL_ERR_ADDRESS;
    }
    if(NULL == data){
        HAL_DEBUGE("parameter [data] is a NULL pointer.");
        return HAL_ERR_ADDRESS;
    }
    if(size > (FMC_END_ADDRESS - start_addr)){
        HAL_DEBUGE("target data size exceed flash atual address scope.");
        return HAL_ERR_ADDRESS;
    }
#endif /* 1 == HAL_PARAMETER_CHECK */
    
    /* save the original data , erase responding page */
    /* save the original data in the processing of writing data */
#if (1 == FLASH_OPER_RESERVE_ORIGINAL_DATA)
    do{
        for(counter = 0; counter < FMC_PAGE_SIZE; counter++){
            _g_fmc_cache[counter] = 0xFFU;
        }
        page_addr = (start_addr / FMC_PAGE_SIZE) * FMC_PAGE_SIZE;
        page_offset = start_addr - page_addr;
 
        /* get the currently transmitting data length */
        if(page_offset + remaining < FMC_PAGE_SIZE){
            length = remaining;
        }else{
            length = FMC_PAGE_SIZE - page_offset;
        }
        
        if(1U == single_page_flag){
            /* process the condition that all data is at the same page */
            update_offset = left_align;
            write_buffer_size = right_align - left_align;
            /* check whether target region content is 0xFF */
            for(counter = left_align; counter < right_align; counter++){
                if(0xFF != REG8(page_addr + counter)){
                    non_ff_flag = 1U;
                    break;
                }
            }
            /* backup the orignal data and erase the page */
            if(1U == non_ff_flag){
                for(counter = 0; counter < left_align; counter++){
                    if(0xFF != REG8(page_addr + counter)){
                        update_offset = counter;
                        write_buffer_size = right_align - counter;
                        break;
                    }
                }

                for(counter = FMC_PAGE_SIZE - 1U; counter >= right_align; counter--){
                    if(0xFF != REG8(page_addr + counter)){
                        write_buffer_size = counter - update_offset + 1U;
                        break;
                    }
                }
                memcpy((uint8_t *)(_g_fmc_cache + update_offset), (uint8_t *)(page_addr + update_offset), write_buffer_size);
                fmc_page_erase(page_addr);
                non_ff_flag = 0U;
            }
        }else{
            /* process the condition that all data cover more than one page */
            if(page_addr == (write_addr_limit - FMC_PAGE_SIZE)){
                /* process the data in last page */
                update_offset = page_offset;  
                write_buffer_size = right_align;
                /* check whether target region content is 0xFF */
                for(counter = 0; counter < right_align; counter++){
                    if(0xFF != REG8(page_addr + counter)){
                        non_ff_flag = 1U;
                        break;
                    }
                } 
                /* backup the orignal data and erase the page */
                if(1U == non_ff_flag){
                    for(counter = FMC_PAGE_SIZE - 1U; counter >= right_align; counter--){
                        if(0xFF != REG8(page_addr + counter)){
                            write_buffer_size = counter + 1U;
                            break;
                        }
                    }
                    /* load from the flash into the cache */
                    memcpy((uint8_t *)(_g_fmc_cache), (uint8_t *)(page_addr), write_buffer_size);
                    /* erase the page, and write the cache */
                    fmc_page_erase(page_addr);
                    non_ff_flag = 0U;
                }
            }else{
                /* process the data in middle pages */
                if(page_addr == start_addr){
                    update_offset = 0U;
                    write_buffer_size = FMC_PAGE_SIZE;
                    /* check whether target region content is 0xFF */
                    for(counter = 0U; counter <  FMC_PAGE_SIZE; counter++){
                        if(0xFF != REG8(page_addr + counter)){
                            non_ff_flag = 1U;
                            break;
                        }
                    }
                    /* erase the page if it is necessary */
                    if(1U == non_ff_flag){
                        fmc_page_erase(page_addr);
                        non_ff_flag = 0U;
                    }
                }else{ 
                    update_offset = left_align;
                    write_buffer_size = FMC_PAGE_SIZE - update_offset;
                    /* process the data in first page */
                    /* check whether target region content is 0xFF */
                    for(counter = left_align; counter < FMC_PAGE_SIZE; counter++){
                        if(0xFF != REG8(page_addr + counter)){
                            non_ff_flag = 1U;
                            break;
                        }
                    }  
                    /* backup the orignal data and erase the page */
                    if(1U == non_ff_flag){
                        for(counter = 0; counter < left_align; counter++){
                            if(0xFF != REG8(page_addr + counter)){
                                update_offset = counter;
                                write_buffer_size = FMC_PAGE_SIZE - update_offset;
                                break;
                            }
                        }
                        /* load from the flash into the cache */
                        memcpy((uint8_t *)(_g_fmc_cache + update_offset), (uint8_t *)(page_addr + update_offset), \
                                           write_buffer_size);
                        /* erase the page, and write the cache */
                        fmc_page_erase(page_addr);
                        non_ff_flag = 0U;
                    }
                }
            }
        }

