SIGS618/GD32IDE-Project---Learn/firmware/GD32E23x_hal_peripheral/Source/gd32e23x_hal_fmc.c
        /* update the cache from the source */
        memcpy((uint8_t *)_g_fmc_cache + page_offset, src_addr, length);

        _fmc_program_align_word(page_addr + update_offset , (uint8_t *)(_g_fmc_cache + update_offset), write_buffer_size);
        start_addr += length;
        src_addr += length;
        remaining -= length;

    }while(remaining > 0);
#else
    while(counter < size){   
        if(0xffU == (REG8(start_addr + counter))){
            counter++;
        }else{
            /* erase the pgae unless all the original data is 0xFF */
            page_addr = ((start_addr + counter)/FMC_PAGE_SIZE) * FMC_PAGE_SIZE;
            fmc_page_erase(page_addr);
            counter++;
        }
    }
    /* save the original data which is outside the writing target range */
    _fmc_program_align_word(start_addr, data, size);
#endif /* save the original data which is outside the writing target range */
    return HAL_ERR_NONE;
}

/*!
    \brief      erase the page which start address locating in 
    \param[in]  start_addr: target region start address 
    \param[out] none
    \retval     fmc_state_enum: state of FMC
      \arg        FMC_READY: the operation has been completed
      \arg        FMC_BUSY: the operation is in progress
      \arg        FMC_PGERR: program error
      \arg        FMC_PGAERR: program alignment error
      \arg        FMC_WPERR: erase/program protection error
      \arg        FMC_TOERR: timeout error
      \arg        FMC_OB_HSPC: option byte security protection code high
*/
fmc_state_enum hal_fmc_page_erase(uint32_t start_addr)
{   
    fmc_state_enum state;
    uint32_t page_offset = 0U;
    
#if (1 == HAL_PARAMETER_CHECK)  
    /* check the parameter */
    if((start_addr < FMC_BASE_ADDRESS)||(start_addr > FMC_END_ADDRESS)){
        HAL_DEBUGE("parameter [start_addr] is a invalid address.");
    }
#endif /* 1 == HAL_PARAMETER_CHECK */
    
    page_offset = start_addr % FMC_PAGE_SIZE;
    state = fmc_page_erase(start_addr - page_offset); 
    return(state);
}

/*!
    \brief      erase the whole flash 
    \param[in]  none
    \param[out] none
    \retval     fmc_state_enum: state of FMC
      \arg        FMC_READY: the operation has been completed
      \arg        FMC_BUSY: the operation is in progress
      \arg        FMC_PGERR: program error
      \arg        FMC_PGAERR: program alignment error
      \arg        FMC_WPERR: erase/program protection error
      \arg        FMC_TOERR: timeout error
      \arg        FMC_OB_HSPC: option byte security protection code high
*/
fmc_state_enum hal_fmc_mass_erase(void)
{
    return(fmc_mass_erase());
}

/*!
    \brief      erase flash target region
    \param[in]  start_addr: target region start address 
    \param[in]  size: target region size
    \param[out] none
    \retval     error code: HAL_ERR_NONE, HAL_ERR_ADDRESS, HAL_ERR_VAL details refer to gd32e23x_hal.h
*/
int32_t hal_fmc_region_erase(uint32_t start_addr, uint32_t size)
{
    uint32_t page_offset, page_number, counter = 0U;
    uint32_t page_addr;
    
#if (1 == HAL_PARAMETER_CHECK)  
    /* check the parameters */
    if((start_addr < FMC_BASE_ADDRESS)||(start_addr > FMC_END_ADDRESS)){
        HAL_DEBUGE("parameter [start_addr] is a invalid address.");
        return HAL_ERR_ADDRESS;
    }
    if(size > (FMC_END_ADDRESS - start_addr)){
        HAL_DEBUGE("target data size exceed flash atual address scope.");
        return HAL_ERR_ADDRESS;
    }
#endif /* 1 == HAL_PARAMETER_CHECK */
    
    page_offset = start_addr % FMC_PAGE_SIZE;
    if((size + page_offset) % FMC_PAGE_SIZE ) {
        page_number =(size + page_offset) / FMC_PAGE_SIZE + 1U;
    }else{
        page_number =(size + page_offset) / FMC_PAGE_SIZE;
    }
    page_addr = start_addr - page_offset;
#if (1 == FLASH_OPER_RESERVE_ORIGINAL_DATA)
    /* page nubmer which buffer refer is equal to one */
    if(1U == page_number){
        _fmc_page_erase_update(_g_fmc_cache, size, page_addr, page_offset);
    }else if(2U == page_number){
        /* page nubmer which buffer refer is equal to two */
        _fmc_page_erase_update(_g_fmc_cache, FMC_PAGE_SIZE - page_offset, \
                         page_addr, page_offset);

        _fmc_page_erase_update(_g_fmc_cache, page_offset + size - FMC_PAGE_SIZE, \
                         page_addr + FMC_PAGE_SIZE, 0);

    }else{
        /* page nubmer which buffer refer is more than two */
        _fmc_page_erase_update(_g_fmc_cache, FMC_PAGE_SIZE - page_offset, \
                         page_addr, page_offset);

        /* erase middle pages */
        for (counter = 1; counter < (page_number - 1U); counter++){
            fmc_page_erase(page_addr + (FMC_PAGE_SIZE * counter));
        }
        counter = (page_offset + size) % FMC_PAGE_SIZE;
        if(0U == counter){
            counter = FMC_PAGE_SIZE;
        }
        _fmc_page_erase_update(_g_fmc_cache, counter, \
                        page_addr + (FMC_PAGE_SIZE * (page_number - 1U)), 0);
    }
#else
    /* erase all the pages which buffer refer */
    for(counter =0U; counter < page_number; counter++){
        fmc_page_erase(page_addr + (counter * FMC_PAGE_SIZE));
    }
#endif /* save the original data which is outside the erasing target range */
    return HAL_ERR_NONE;
}

/*!
    \brief      fmc interrupt handler content function, which is merely used in fmc_handler
    \param[in]  p_irq: pointer to fmc interrupt handler callback function 
    \param[out] none
    \retval     none 
*/ 
void hal_fmc_irq(hal_fmc_irq_struct *p_irq)
{
    if(SET == fmc_interrupt_flag_get(FMC_INT_FLAG_PGERR | FMC_INT_FLAG_PGAERR | FMC_INT_FLAG_WPERR)){
        fmc_interrupt_flag_clear(FMC_INT_FLAG_PGERR | FMC_INT_FLAG_PGAERR | FMC_INT_FLAG_WPERR);
        if(p_irq->error_handle != NULL){
            p_irq->error_handle(p_irq);
        }
    }
    
    if(SET == fmc_interrupt_flag_get(FMC_INT_FLAG_END)){
        fmc_interrupt_flag_clear(FMC_INT_FLAG_END);
        if(p_irq->finish_handle != NULL){
            p_irq->finish_handle(p_irq);
        }
    }
}

/*!
    \brief      set user-defined interrupt callback function, which will be registered and called 
                when corresponding interrupt be triggered
    \param[in]  p_irq: pointer to fmc interrupt handler callback function 
    \param[out] none
    \retval     none 
*/ 
void hal_fmc_irq_handle_set(hal_fmc_irq_struct *p_irq)
{
    if(NULL != p_irq->error_handle){
        p_irq->error_handle(p_irq);
        fmc_interrupt_enable(FMC_INTEN_ERR);
    }else{
        fmc_interrupt_disable(FMC_INTEN_ERR);
    }
    
    if(NULL != p_irq->finish_handle){
        p_irq->finish_handle(p_irq);
        fmc_interrupt_enable(FMC_INTEN_END);
    }else{
        fmc_interrupt_disable(FMC_INTEN_END);
    }
}
 
/*!
    \brief      reset user-defined interrupt callback function, which will be registered and called 
                when corresponding interrupt be triggered
    \param[in]  p_irq: pointer to fmc interrupt handler callback function 
    \param[out] none
    \retval     none 
*/ 
void hal_fmc_irq_handle_all_reset(hal_fmc_irq_struct *p_irq)
{
    p_irq->error_handle = NULL;
    p_irq->finish_handle = NULL;
}

/*!
    \brief      unlock option byte 
    \param[in]  none
    \param[out] none
    \retval     none
*/
void hal_ob_unlock(void)
{
    ob_unlock();
}

/*!
    \brief      lock option byte 
    \param[in]  none
    \param[out] none
    \retval     none
*/
void hal_ob_lock(void)
{
    ob_lock();
}

/*!
    \brief      reset option byte 
    \param[in]  none
    \param[out] none
    \retval     none
*/
void hal_ob_reset(void)
{
    ob_reset();
}

/*!
    \brief      erase option byte 
    \param[in]  none
    \param[out] none
    \retval     fmc_state_enum: state of FMC
      \arg        FMC_READY: the operation has been completed
      \arg        FMC_BUSY: the operation is in progress
      \arg        FMC_PGERR: program error
      \arg        FMC_PGAERR: program alignment error
      \arg        FMC_WPERR: erase/program protection error
      \arg        FMC_TOERR: timeout error
      \arg        FMC_OB_HSPC: option byte security protection code high
*/
fmc_state_enum hal_ob_erase(void)
{
    return(ob_erase());
}

/*!
    \brief      configure option byte security protection
    \param[in]  ob_spc: specify security protection code
      \arg        FMC_NSPC: no security protection
      \arg        FMC_LSPC: low security protection
      \arg        FMC_HSPC: high security protection
    \param[out] none
    \retval     fmc_state_enum: state of FMC
      \arg        FMC_READY: the operation has been completed
      \arg        FMC_BUSY: the operation is in progress
      \arg        FMC_PGERR: program error
      \arg        FMC_PGAERR: program alignment error
      \arg        FMC_WPERR: erase/program protection error
      \arg        FMC_TOERR: timeout error
      \arg        FMC_OB_HSPC: option byte security protection code high
*/
fmc_state_enum hal_ob_security_protection_config(uint8_t ob_spc)
{
    return (ob_security_protection_config(ob_spc));
}

/*!
    \brief      write option byte user
                this function can only clear the corresponding bits to be 0 rather than 1.
                the function ob_erase is used to set all the bits to be 1.
    \param[in]  ob_user: user option byte
                one or more parameters (bitwise AND) can be selected which are shown as below:
      \arg        OB_FWDGT_HW: hardware free watchdog timer
      \arg        OB_DEEPSLEEP_RST: no reset when entering deepsleep mode
      \arg        OB_STDBY_RST: no reset when entering standby mode
      \arg        OB_BOOT1_SET_1: BOOT1 bit is 1
      \arg        OB_VDDA_DISABLE: disable VDDA monitor
      \arg        OB_SRAM_PARITY_ENABLE: enable sram parity check
    \param[out] none
    \retval     fmc_state_enum: state of FMC
      \arg        FMC_READY: the operation has been completed
      \arg        FMC_BUSY: the operation is in progress
      \arg        FMC_PGERR: program error
      \arg        FMC_PGAERR: program alignment error
      \arg        FMC_WPERR: erase/program protection error
      \arg        FMC_TOERR: timeout error
      \arg        FMC_OB_HSPC: option byte security protection code high
*/
fmc_state_enum hal_ob_user_write(uint8_t ob_user)
{
    return (ob_user_write(ob_user));
}

/*!
    \brief      program the FMC data option byte
    \param[in]  addr: OB_DATA_ADDR0 or OB_DATA_ADDR1
      \arg        OB_DATA_ADDR0: option byte data address 0
      \arg        OB_DATA_ADDR1: option byte data address 1
    \param[in]  data: the byte to be programmed
    \param[out] none
    \retval     fmc_state_enum: state of FMC
      \arg        FMC_READY: the operation has been completed
      \arg        FMC_BUSY: the operation is in progress
      \arg        FMC_PGERR: program error
      \arg        FMC_PGAERR: program alignment error
      \arg        FMC_WPERR: erase/program protection error
      \arg        FMC_TOERR: timeout error
      \arg        FMC_OB_HSPC: option byte security protection code high
*/
fmc_state_enum hal_ob_data_program(uint16_t ob_data)
{
    return(ob_data_program(ob_data));
}

/*!
    \brief      enable the targeted address region written protection
    \param[in]  start_addr: target region start address 
    \param[in]  data_size: target region size
    \param[out] none
    \retval     sector_addr_range_struct: actual start and end address
*/
hal_sector_addr_range_struct hal_ob_wp_enable(uint32_t start_addr, uint32_t data_size)
{
    uint8_t index, counter, sub_counter;
    hal_sector_addr_range_struct sector;
    uint16_t wp_temp0 = (uint16_t)REG8(OB + 8U);
    uint16_t wp_temp1 = (uint16_t)(REG8(OB + 0xaU) << 8U);
    uint16_t wp_prev = wp_temp0 | wp_temp1; 
    uint16_t wp = 0U;
    uint16_t wp_sector = 1U ;
    uint8_t sector_number;
    
