SIGS618/GD32IDE-Project---Learn/firmware/GD32E23x_hal_peripheral/Source/gd32e23x_hal_fmc.c
#if (1 == HAL_PARAMETER_CHECK)  
    /* check the parameters */
    if((start_addr < FMC_BASE_ADDRESS)||(start_addr > FMC_END_ADDRESS)){
        HAL_DEBUGE("parameter [start_addr] is a invalid address.");
    }
    if(data_size > (FMC_END_ADDRESS - start_addr)){
        HAL_DEBUGE("target data size exceed flash atual address scope.");
    }
#endif /* 1 == HAL_PARAMETER_CHECK */
    
    index = (start_addr & 0x000f000U) >> 12U;
    if(data_size % FMC_SECTOR_SIZE){
        sector_number = data_size / FMC_SECTOR_SIZE + 1U;
    }else{
        sector_number = data_size / FMC_SECTOR_SIZE;
    }      
    for(counter = 0U; counter < sector_number ; counter++){
        for(sub_counter = 0U; sub_counter < (index + counter); sub_counter++){
            wp_sector = 2U * wp_sector;
        }
        wp = wp + wp_sector;
        wp_sector = 1U;
    }
    /* check current write protection sector, if there is confict, erase option byte */
    if(((0xFFU != (uint8_t)wp_prev)&&(0U != (uint8_t)wp)) || ((0xFFU != (uint8_t)(wp_prev >> 8U))&&(0 != (uint8_t)(wp >> 8U)))){  
        wp = wp | (~wp_prev);
        ob_erase();  
    }
    /* enable the target sector write protected */
    ob_write_protection_enable(wp);
 
    /* define actual address range which is writen protected */
    sector.sector_start_addr = FMC_BASE_ADDRESS + index * FMC_SECTOR_SIZE;
    sector.sector_end_addr = sector.sector_start_addr + sector_number * FMC_SECTOR_SIZE;
 
    return(sector);
 }

/*!
    \brief      disable the targeted address region written protection
    \param[in]  start_addr: target region start address 
    \param[in]  data_size: target region size
    \param[out] none
    \retval     sector_addr_range_struct: actual start and end address
*/
hal_sector_addr_range_struct hal_ob_wp_disable(uint32_t start_addr, uint32_t data_size)
{
    uint8_t index, counter, sub_counter;
    hal_sector_addr_range_struct sector;
    uint16_t wp_temp0 = (uint16_t)REG8(OB + 8U);
    uint16_t wp_temp1 = (uint16_t)(REG8(OB + 0xaU) << 8U);
    uint16_t wp_prev = wp_temp0 | wp_temp1;  
   
    uint16_t wp = 0U;
    uint16_t wp_sector = 1U ;
    uint8_t page_number;
    
#if (1 == HAL_PARAMETER_CHECK)  
    /* check the parameters */
    if((start_addr < FMC_BASE_ADDRESS)||(start_addr > FMC_END_ADDRESS)){
        HAL_DEBUGE("parameter [start_addr] is a invalid address.");
    }
    if(data_size > (FMC_END_ADDRESS - start_addr)){
        HAL_DEBUGE("target data size exceed flash atual address scope.");
    }
#endif /* 1 == HAL_PARAMETER_CHECK */
    
    index = (start_addr & 0x000f000U) >> 12U;
    if(data_size % FMC_SECTOR_SIZE){
        page_number = data_size / FMC_SECTOR_SIZE + 1U;
    }else{
        page_number = data_size / FMC_SECTOR_SIZE;
    }      

    for(counter = 0U; counter < page_number ; counter++){
        for(sub_counter = 0U; sub_counter < (index + counter); sub_counter++){
            wp_sector = 2U * wp_sector;
        }
        wp = wp + wp_sector;
        wp_sector = 1U;
    }
    /* disable the target sector write protected */
    wp = (~wp) & (~wp_prev);
    
    ob_erase();    

    ob_write_protection_enable(wp);
 
    /* define actual address range which is writen protected */
    sector.sector_start_addr = FMC_BASE_ADDRESS + index * FMC_SECTOR_SIZE;
    sector.sector_end_addr = sector.sector_start_addr + page_number * FMC_SECTOR_SIZE;
 
    return(sector);
 }

/*!
    \brief      get option byte parameters, which are stored in register FMC_OBSTAT and FMC_WP
    \param[in]  p_parm: pointer to currently valid option byte parameters 
    \param[out] none
    \retval     error code: HAL_ERR_NONE, HAL_ERR_ADDRESS, HAL_ERR_VAL details refer to gd32e23x_hal.h
*/ 
int32_t hal_ob_parm_get(hal_ob_parm_get_struct *p_parm)
{
#if (1 == HAL_PARAMETER_CHECK)  
    /* check the parameter */
    if(NULL == p_parm){
        HAL_DEBUGE("parameter [p_parm] is a NULL pointer.");
        return HAL_ERR_ADDRESS;
    }
#endif /* 1 == HAL_PARAMETER_CHECK */
    
    /* get the information of option byte */
    p_parm->data = ob_data_get();
    p_parm->user = ob_user_get();
    p_parm->security_protection = ob_obstat_plevel_get();
    p_parm->write_protection = ob_write_protection_get();

    return HAL_ERR_NONE;
}

/*!
    \brief      configure option byte parameters thoroughly
    \param[in]  ob_parm: pointer to option byte struct used to configure its parameters 
    \param[out] none
    \retval     error code: HAL_ERR_NONE, HAL_ERR_ADDRESS, HAL_ERR_VAL details refer to gd32e23x_hal.h
*/ 
int32_t hal_ob_parm_config(hal_ob_parm_config_struct *ob_parm)
{

    uint8_t spc = 0xA5U;
    uint8_t user = 0xFFU;
    uint16_t data = 0xFFFFU;
    uint16_t wrp = 0xFFFFU;
    uint8_t wrp_flag = 0U;
    uint64_t ob_parameter = 0U;
    uint32_t data_temp0, data_temp1, wp_temp0, wp_temp1;
    fmc_state_enum fmc_state;
    
#if (1 == HAL_PARAMETER_CHECK)  
    /* check the parameter */
    if(NULL == ob_parm){
        HAL_DEBUGE("parameter [ob_parm] is a NULL pointer.");
        return HAL_ERR_ADDRESS;
    }
#endif /* 1 == HAL_PARAMETER_CHECK */
    
    /* unlock flash and option byte */
    hal_fmc_unlock();
    hal_ob_unlock();

    /* check whether spc is default value */
    if(OB_SPC != spc){
        spc = OB_SPC;
    }
    /* check whether user is default value */
    if(OB_USER != user){
        user = OB_USER;
    }
    /* check whether data is default value */
    if((OB_DATA0 != (uint8_t)data) || (OB_DATA1 != (uint8_t)(data >> 8U))){
        data_temp0 = (uint16_t) OB_DATA0;
        data_temp1 = (uint16_t)(OB_DATA1 << 8U);
        data = data_temp0 | data_temp1;
    } 
    /* check whether WP is default value */
    if ((OB_WP0 != (uint8_t)wrp) || (OB_WP1 != (uint8_t)(wrp >> 8U))){
        wp_temp0 = (uint16_t) OB_WP0;
        wp_temp1 = (uint16_t)(OB_WP1 << 8U);
        wrp = wp_temp0 | wp_temp1;
        wrp_flag = 1U;
    }
    /* write protection process */
    if(ob_parm->ob_type & OB_TYPE_WRP){
        if(OB_WRP_ENABLE == ob_parm->wrp_state){
            hal_ob_wp_enable(ob_parm->wrp_addr, ob_parm->wrp_size);
            wp_temp0 = (uint16_t) OB_WP0;
            wp_temp1 = (uint16_t)(OB_WP1 << 8U);
            wrp = wp_temp0 | wp_temp1;
            wrp_flag = 0U;
        }else{
            hal_ob_wp_disable(ob_parm->wrp_addr, ob_parm->wrp_size);
            wp_temp0 = (uint16_t) OB_WP0;
            wp_temp1 = (uint16_t)(OB_WP1 << 8U);
            wrp = wp_temp0 | wp_temp1;
            wrp_flag = 0U;
        }
    } 
    /* security protection process */
    if(ob_parm->ob_type & (OB_TYPE_SPC | OB_TYPE_USER | OB_TYPE_DATA)){
        wrp_flag = 1U;
        if(ob_parm->ob_type & OB_TYPE_SPC)
        spc = ob_parm->spc_level;
        if(ob_parm->ob_type & OB_TYPE_USER)
        user &= ob_parm->user;
        if(ob_parm->ob_type & OB_TYPE_DATA)
        data = ob_parm->data_value;
        
        ob_parameter = ((uint64_t)spc |(uint64_t)(user << 16U) | (uint64_t)((uint8_t)data) << 32U
                       | (uint64_t)(data >> 8U) << 48U);

        FMC_WS |= FMC_WS_PGW;
        /* start erase the option byte */
        FMC_CTL |= FMC_CTL_OBER;
        FMC_CTL |= FMC_CTL_START;
        /* wait for the FMC ready */
        fmc_state = fmc_ready_wait(FMC_TIMEOUT_COUNT);
    
        if(FMC_READY == fmc_state){
        
            /* reset the OBER bit */
            FMC_CTL &= ~FMC_CTL_OBER;
      
