SIGS618/GD32IDE-Project---Learn/firmware/GD32E23x_hal_peripheral/Source/gd32e23x_hal_fmc.c
            /* enable the option bytes programming */
            FMC_CTL |= FMC_CTL_OBPG;
       
            OB_SPC_USER = (uint32_t)ob_parameter;
            OB_DATA = (uint32_t)(ob_parameter >> 32U);
            
            /* wait for the FMC ready */
            fmc_state = fmc_ready_wait(FMC_TIMEOUT_COUNT); 

            FMC_WS &= ~(FMC_WS_PGW);
            if(FMC_TOERR != fmc_state){
                /* reset the OBPG bit */
                FMC_CTL &= ~FMC_CTL_OBPG;
            }
        }else{
            if(FMC_TOERR != fmc_state){
                /* reset the OBER bit */
                FMC_CTL &= ~FMC_CTL_OBER;
            }
        }
        
    }
    /* if previously actual option byte value exist, write it back */
    if(1U == wrp_flag){
        ob_write_protection_enable(~wrp);
    }
    /* lock flash and option byte */
    hal_ob_lock();
    hal_fmc_lock();

    return HAL_ERR_NONE;
}
/*!
    \brief      write target data aligned in word
    \param[in]  p_buffer: pointer to data buffer
    \param[in]  size: target region size
    \param[in]  page_addr: page head address
    \param[in]  page_offset: the offset with respect to page head address
    \param[out] none
    \retval     none
*/
static void _fmc_page_erase_update(uint8_t *p_buffer, uint32_t size, uint32_t page_addr, \
                             uint32_t page_offset)
{
    uint32_t temp;
    uint32_t counter;
    uint32_t update_index = 0U;
    
    temp = (uint32_t)p_buffer;

    for(counter = 0U; counter < FMC_PAGE_SIZE; counter += 4){
        if(0xFFFFFFFF != REG32(page_addr + counter)){
            update_index = counter;
            break;
        }
    }
    
    if(FMC_PAGE_SIZE != counter){
        for(counter = update_index; counter < FMC_PAGE_SIZE; counter += 4){
            REG32(temp + counter) = REG32(page_addr + counter);
        }

        /* configure the target region to 0xFF */
        for(counter = 0U;counter < size; counter++){
            p_buffer[page_offset + counter] = 0xFFU;
        }
        
        fmc_page_erase(page_addr);
        
        /* write the orignal data to address outside the target range */
        temp = (uint32_t)p_buffer;
        for(counter = update_index; counter < FMC_PAGE_SIZE; counter += 4){
            fmc_word_program(page_addr + counter, REG32(temp + counter));
        }
    }
}

/*!
    \brief      write target data aligned in word
    \param[in]  start_addr: target region start address 
    \param[in]  data: pointer to target data
    \param[in]  data_size: target region size
    \param[out] none
    \retval     none
*/
static void _fmc_program_align_word(uint32_t dst_addr, uint8_t *data, uint32_t data_size)
{
    uint32_t head_offset, tail_offset, data_offset;
    uint32_t data_addr_align, data_size_align;
    uint32_t counter;
    uint32_t temp_addr;
    uint8_t align_buffer[4] = {0xFF, 0xFF, 0xFF, 0xFF};
    
    head_offset = dst_addr % 4U;
    tail_offset = (data_size + head_offset) % 4U;
    
    if(0 != head_offset){
        /* write the target region if front address is non-aligned */
        data_addr_align = dst_addr + (4 - head_offset);
        data_size_align = data_size - (4 - head_offset);
        
        temp_addr = (uint32_t)data;
        for(counter = head_offset; counter < 4; counter++){
            align_buffer[counter] = REG8(temp_addr);
            temp_addr++;
        }
        data_offset = 4 - head_offset;
        fmc_word_program(dst_addr - head_offset, REG32(align_buffer));
    }else{
        /* write the target region aligned address */
        data_addr_align = dst_addr;
        data_size_align = data_size;
        data_offset = 0;
    }
    /* write the target region if back address is non-aligned */
    if(0 != tail_offset){
        data_size_align = data_size - tail_offset;
        
        temp_addr = (uint32_t)data;
        temp_addr = temp_addr + data_size - tail_offset;
        for(counter = 0; counter < tail_offset; counter++){
            align_buffer[counter] = REG8(temp_addr);
            temp_addr++;
        }
        
        fmc_word_program(dst_addr + data_size - tail_offset, REG32(align_buffer));
    }
    /* write the target region middle aligned address */
    temp_addr = (uint32_t)data + data_offset;
    for(counter = 0; counter < data_size_align; counter += 4){
        fmc_word_program(data_addr_align + counter, REG32(temp_addr + counter));
    }
}
